# -*- coding: utf-8 -*-
#

### 乾燥の保守
DryMaintain =
  [ # plan.id 保守時間  保守 採用時間    累積 
   [[35,36],[ 0.minute ,[nil]], [  5.minute,[]], [  5.minute,["切替"]], "普3×10(東原)同じ銘柄"],
   [[37,36],[ 0.minute ,[nil]], [  5.minute,[]], [  5.minute,["切替"]], "普3×10(東原)水曜日"],
   [[35,43],[ 0.minute ,[nil]], [360.minute,[107]], [360.minute,[107    ]], "普3×10(東原)S1コタタキ(東原)"],
   [[40,43],[ 0.minute ,[nil]], [360.minute,[107]    ], [360.minute,[107]    ], "12高級(東原)S1コタタキ(東原)"],
   nil
   

  ]
### 加工の保守。保守仮割付
KakouMaintain =
  [ # plan.id 保守時間  保守 採用時間    累積 
   [[35,36],[ 0.minute  ,[nil]], [ 5.minute,[]],[  5.minute,["切替"]],"普3×10(東原)同じ銘柄"],
   [[37,36],[ 240.minute,[109 ]],[ 5.minute,[]],[240.minute,[109   ]],"普3×10(東原)水曜日"],
   [[35,42],[ 0.minute  ,[nil]], [40.minute,[]],[ 40.minute,["切替"]],"普3×10(東原)F3×10(西原)"],
   [[40,34],[ 0.minute  ,[nil]], [60.minute,[]],[ 60.minute,["切替"]],"12高級(東原)ショップ(東原)"],
   nil
   

  ]
### 抄造の保守。保守仮割付フェルト替え
ShozoMaintain =
  [ # plan.id 保守時間  保守 採用時間    累積 
   [[35,36],[ 0.minute   ,[nil]   ,   5,["切替"]],[[1000   ,:wf]], "1000+2340 ではWF替 はしない"],
   [[35,36],[ 0.minute   ,[nil]   ,   5,["切替"]],[[177659 ,:wf]], "177659+2340 ではWF替 はしない"],
   [[35,36],[1440.minute ,[111]    ,1440,[111]    ],[[177661,:wf]], "177661+2340 ではWF替 を行う"],
   [[35,43],[ 0.minute   ,[nil]   ,  25,["切替"]],[[150000-2305 ,:wf]], "S1は150000-2305 ではWF替 はしない"],
   [[35,43],[1440.minute ,[111]    ,1440,[111]    ],[[150000-2303 ,:wf]], "S1は150000-2303 ではWF替を行う"],
   [[35,36],[ 0.minute   ,[nil]   ,   5,["切替"]],[[(1000-5.5).hour ,:pf]], "1000-5.5 ではPF替 はしない"],
   [[35,36],[1440.0.minute,[115]   ,1440,[115]    ],[[(1000-4).hour ,:pf]], "1000-4 ではPF替 を行う"],
  #[[35,36],[2880.0.minute,[55,111],],[[177661,:wf],[(1000-5.2).hour ,:pf]], "PF,WF両方 を行う"],
   #[[40,41],[2880.0.minute,[115,111],2880,[113,115,111] ],[[177661,:wf],[(1000-5.2).hour ,:pf]], "サランPF,WF両方 を行う"],
   [[40,41],[ 0.minute   ,[nil]   , 480,[113] ],[[17766,:wf],[(100-5.2).hour ,:pf]], "サラン3×6切替"],
   nil
   

  ]
###
Maintain =
  [                               #保全実施日
   [:shozoe,[35,36],[ 0.minute, [nil]],1 ,"普3×10同じ銘柄"],
   [:kakou ,[35,36],[ 0.minute, [nil]],1 ,"普3×10同じ銘柄"],
   [:kakou ,[37,35],[240.minute, [109]],1 ,"水曜午前"],
   [:kakou ,[37,35],[ 0.minute, [nil]],20,"水曜午前"],
   nil
  ]

ChangeDifferMeigara =
  [
   [:shozoe,[35,36],[ 5.minute,[ ]],"普3×10同じ銘柄"],
   [:shozoe,[35,37],[ 5.minute,[ ]], "普3×10銘柄違い"],
   [:shozoe,[35,38],[ 5.minute,[ ]],"普3×10空とあり"],
   [:shozoe,[38,39],[ 5.minute,[ ]], "普3×10空空"],
   [:shozoe,[29,30],[ 5.minute,[ ]],"16高級長切替：同じ同士"],
   [:shozoe,[29,32],[25.minute,[ ]],"16高級長切替：空とあり"],#
   [:shozoe,[32,33],[ 5.minute,[ ]],"16高級長切替：空空"],#
   [:shozoe,[29,31],[25.minute,[ ]],"16高級長切替：銘柄違い"],#
   ## 記名切り替え                      
   [:shozoe,[29,34],[480.minute,[114    ]],"->16高級 記名切替"],
   [:shozoe,[34,29],[480.minute,[114    ]],"->16高級 記名切替"],#
   [:shozoe,[40,29],[480.minute,[114    ]],"12高級->16高級 記名切替"],#
   [:shozoe,[40,35],[480.minute ,[113 ]],"12高級->12普3×10 記名切替"],#
   [:shozoe,[40,41],[480.minute,[113, 118]],"12高級->12普3×6 記名切替"],#
   #
   [:dryo,[35,36],[ 5.minute,[ ]],"普3×10同じ銘柄"],
   [:dryo,[35,37],[ 5.minute,[ ]], "普3×10銘柄違い"],
   [:dryo,[35,38],[ 5.minute,[ ]],"普3×10空とあり"],
   [:dryo,[38,39],[ 5.minute,[ ]], "普3×10空空"],
   [:dryo,[29,30],[ 5.minute,[ ]],"16高級長切替：同じ同士"],
   [:dryo,[29,32],[40.minute,[ ]],"16高級長切替：空とあり"],#
   [:dryo,[32,33],[ 5.minute,[ ]],"16高級長切替：空空"],#
   [:dryo,[29,31],[40.minute,[ ]],"16高級長切替：銘柄違い"],#
   ## 記名切り替え                
   [:dryo,[29,34],[ 5.minute,[]],"16高級-> 記名切替"],
   [:dryo,[34,29],[40.minute,[]],"->16高級 記名切替"],#
   [:dryo,[40,29],[40.minute,[]],"12高級->16高級 記名切替"],
   [:dryo,[40,35],[ 5.minute ,[]],"12高級->12普3×10 記名切替"],#
   [:dryo,[35,40],[40.minute ,[]],"12普3×10->12高級"],#
   [:dryn,[42,41],[ 90.minute,[117    ]],"F3×10(西新)->12普3×6 記名切替"],
   #
   [:yojo,[42,41],[ 0.minute,[nil  ]],"F3×10(西新)->12普3×6 記名切替"],#
   nil                      #            12高級	12普3×6
  ]

ChangeTimeList = 
  [#pro_id,pro_id,change
   [20,20 ,25] ,  #16高級(東原) 16高級(東原)
   [26,26,  5] ,  #普3×10(東原)普3×10(東原)
   [20,26,480] ,  #16高級(東原) 普3×10(東原)
   [26,20,480] ,  #普3×10(東原) 16高級(東原)
  ]
