# -*- coding: utf-8 -*-
#
### 加工の保守,製造仮割付
KakouMaintPlan =
  [ # plan.id 保守/切り替え時間,製造時間, 累積 
   [:kakou ,[58,59],[],[ 5.minute,["切替"]],"06/08-09:19","普3×10(東原)同じ銘柄。移動律速。製造が休み前に入る"],
   [:kakou ,[60,59],[],[240.minute ,[109  ]],"06/20-13:00"  , "普3×10(東原)水曜日"],
   [:kakou ,[58,63],[],[60.minute,["切替"]],"06/08-09:04","普3×10(東原)12高級(東原)切り替え60分"],
   [:kakou ,[59,63],[],[240.minute ,[109  ]],"06/20-13:11","普3×10(東原)12高級(東原)切り替え60分水曜日4hr"],
   nil
  ].
  each{|plan| plan[4] = Time.parse("2012/"+plan[4] ) if plan}

YojoMaintPlan =
  [
   [:yojo  ,[58,59],[],[],"06/08-09:35","普3×10(東原)同じ銘柄切り替え"],
   [:yojo  ,[42,53],[],[],"06/08-08:09","F3×10(西原) 16F化粧(西新)西の移動は60分"],
   #[[37,36],[240.minute,[109 ]],[ 5.minute,[]], [240.minute,240.minute,[109    ]], "普3×10(東原)水曜日"],
   #[[35,42],[  0.minute,[nil]],[40.minute,[]], [ 40.minute, 40.minute,["切替"]], "普3×10(東原)F3×10(西原)"],
   #[[40,34],[  0.minute,[nil]],[60.minute,[]], [ 60.minute, 60.minute,["切替"]], "12高級(東原)ショップ(東原)"],
   nil
  ].
  each{|plan| plan[4] = Time.parse("2012/"+plan[4] ) if plan}

ShozoMaintPlan =
  [
   [:shozoe,[58,59],[[1000  ,:wf]],8,["6/8 8:04","6/8 8:09",["切替"]],["6/8 8:09"],"普3×10(東原)同じ銘柄切り替え5分"],
   [:shozoe,[58,59],[[200000,:wf]],8,["6/8 8:04","6/9 8:04",[111]    ],["6/9-8:04"],"普3×10(東原)WF替え"],
   [:shozoe,[59,63],[[1876,:wf]]  ,8,["6/8 9:05","6/8 9:30",["切替"]],["06/08-09:30"],"普3×10(東原)12高級(東原)切り替え25min"],
   [:shozoe,[60,59],[[2000,:wf]],  6,["6/7 2:00","6/7 2:05",["切替"]],["06/07-02:05"],"普3×10(東原) 休転前に製造が終わる"],
   [:shozoe,[40,41],[[177661,:wf],[(1000-5.2).hour ,:pf]],8,
    ["06/08-07:09", "06/10-07:09",[113,115,111] ],["06/11-11:00"], "サランPF,WF両方 を行う。運休が入る"],
   [:shozoe,[60,59],[[200000,:wf]] ,6,["6/7 2:00","6/8 2:00",[111]],["06/08-08:00"],"普3×10(東原) WF替え.休転が6/8 まで入る"],
  # [:shozoe,[60,63],[[1876,:wf]]  ,[   5.minute,["切替"]],"06/08-08:00","普3×10(東原)12高級(東原)切替8時間休転が6/8 まで入る"],
   nil
  ].
  each{|plan|
  [0,1].each{|i| plan[4][i] = Time.parse("2012/"+plan[4][i] )} if plan
   plan[5][0]= Time.parse("2012/"+plan[5][0] )  if plan
}
ShozoMaintPlanSansen =
  [
   [:shozoe,[58,59],[[1000  ,:wf]],7,["6/8 8:04","6/8 10:04",[106]],["6/8 10:04"],"普3×10(東原)同じ銘柄切り替え5分"],
   [:shozoe,[58,59],[[200000,:wf]],7,["6/8 8:04","6/9 8:04",[111]    ],["6/9-8:04"],"普3×10(東原)WF替え"],
   [:shozoe,[59,63],[[1876,:wf]]  ,7,["6/8 9:05","6/8 11:05",[106]],["06/08-11:05"],"普3×10(東原)12高級(東原)切り替え25min"],
   [:shozoe,[60,59],[[2000,:wf]],  6,["6/7 2:00","6/7 2:05",["切替"]],["06/07-02:05"],"普3×10(東原) 休転前に製造が終わる"],
   [:shozoe,[40,41],[[177661,:wf],[(1000-5.2).hour ,:pf]],7,
    ["06/08-07:09", "06/10-07:09",[113,115,111] ],["06/11-11:00"],
    "サランPF,WF両方 を行う。運休が入る"],
   [:shozoe,[60,59],[[200000,:wf]] ,6,["6/7 2:00","6/8 2:00",[111]],["06/08-08:00"],"普3×10(東原) WF替え.休転が6/8 まで入る"],
   [:shozoe,[62,60],[[1876,:wf]]  ,1, ["6/3 2:50","6/3 2:55",["切替"]],["06/05-11:00"],"普3×10(東原) 始業と重なる酸洗は記名しない"],
   nil
  ].
  each{|plan|
  [0,1].each{|i| plan[4][i] = Time.parse("2012/"+plan[4][i] )} if plan
   plan[5][0]= Time.parse("2012/"+plan[5][0] )  if plan
}
### 乾燥

DryMaintPlan =
  [               #保守　　　　　　　　　　　　　　　製造開始
   #[06/08-08:14, 06/08-16:19, 06/08-11:06, 06/08-13:27]
   [:dryo,[64,65],["06/08-13:05","6/8 13:10",["切替"]],["06/08-13:10"],"普3×10(東原)同じ銘柄切り替え、製造が休み前に入る"],
   #[:dryo,[64,69],["6/8 13:27","6/8 13:32",["切替"]],["06/08-14:07"],"普3×10(東原)"],
   #[:dryo,[66,67],"06/07-08:00",170.minute,[],"普3×10(東原) 休転が6/7 まで入る"],
   # 
   [:dryo,[64,68],["06/08-13:05","6/8 13:10",["切替"]],["06/08-13:45"],"養生終了が前の品種の終了時間より後"],
   nil
  ].
  each{|plan|
  [0,1].each{|i| plan[2][i] = Time.parse("2012/"+plan[2][i] )} if plan
   plan[3][0]= Time.parse("2012/"+plan[3][0] )  if plan
}  
