# -*- coding: utf-8 -*-
StatFont = [[Postscript::Gothic,1.4],[Postscript::Bold,1.8],[Postscript::Gothic,1.4]]
module Ubr::Const

  @dir= File.dirname(__FILE__)
  if /www/ =~ @dir
    $LOAD_PATH << @dir
    MasterDir =  @dir
  else
    $LOAD_PATH << File.join(File.dirname(__FILE__),"../System") << "~/lib/ruby"
    MasterDir =  File.join(@dir,"../System/Master")
  end

  Oneways = %w(G123DC700V------F7 G123DC6061------F7 G123DC820------F7 G123DC830------F7 G123DC720------F7 G123DZ691------F7)

Converator = [[80.7,30.5],[80.7,32.5],[83.7,32.5],[83.7,30.5],[80.7,30.5]]

# 総合倉庫壁位置定数

                    xw=xc= 0; xa=6.165+6*7; x2=xa+6; x3l=x2+6*5;x3r=x3l+6; xe = 6.165+6*18+4.065
                             x1l = 25.156;x1r=x1l+4
                #    xw,xc             xa  x2             x3l  x3r        xe
  yn=ya = 0     #  yn +                 +   +--------------+    +----------+
                #             x1l,r    xp   |              |    |          |
  yc = 6        #  yc +--------  -------+---+              +-  -+          |
                #     |                 |                   x4             |
                #     |                 |                                  |
                #     |                 |                                  |
                #     |                 |                                  |
                #     |                 |                                  |
                #     |x4 xb         x8 |              x6      x5          |
  ys=y2 = 46.13 #  y2 +-  -+          +-+               +----  ------------+ ys
  yb = y2 + 1.3 #        yb+----------+                 |
                #          |          |                 |
  y3  = y2 + 10 #       x7 |          +-----------------+ y3
  y8 =90.7-10.25#      y8 +           |                 
                #         |   x9      |                 
  y4 = 90.7     #         +--  -------+ y4
                       x4 = xw+7.165 ;
                       x7=15.68;xb=x7+2.32; x8 =xb+30.33;x6=x8+29; x5=xe-4.065-25
                       x9= xb+5

$SoukoFloors = { 
  "0A" =>   Ubr::SoukoFloor.
  new(:outline    => [[xa-xw,ya-yn],[xe-xw,ys-yn]],
      :walls => [ [ [0,yc-ya],[x2-xa,yc-ya],[x2-xa,yn-ya],[x3l-xa,yn-ya],
                    [x3l-xa,yc-ya], [x3l-xa+1,yc-ya]], # NWから凹部左
                  [ [x3r-xa-1,yc-ya],[x3r-xa,yc-ya],[x3r-xa,yn-ya],          # 凹部から入口東
                    [xe-xa,0-ya],[xe-xa,y2-ya],[x5-xa,y2-ya]],  #N入口東から南入り口まで
                  [ [x5-4-xa,y2-ya],[x6-xa,y2-ya],[x6-xa,y3-ya],[x8-xa,y3-ya], # 南入り口から機材置き場SW
                    [x8-xa,y2-ya],  [xa-xa,y2-ya],[xa-xa,yc-ya]]               # 機材置き場SWから仕切り、エリアAのNW
                ],
      :contents   => %w(0A 0A 0A 0A  0B 0B 0B),  # w 69.6m h 47.2m
      :sufix      => %w(01 21 37 40  01 21 36),
      :max        => %w(20 36 39 41  20 35 50),
      #建物基準点から置き場ブロック基準点までの m。ブロックの左上を標準にする
      :base_points => [ [1,11],[42.9,11.0],[48.5,1.0],[30,1],
                        [1,28],[43.7,39.0],[43.7,32.8]
                      ] ,
      :label_pos => [ [15,-1],[11,-1.2],[-3.5,3],[1.2,2.2],[15,-1],[11,-0.5],[11,2.2]  ]
      ),
  "0B" =>   Ubr::SoukoFloor.
  new( 
      :outline    => [[xb-xw,yb-yn],[x8-xw,y4-yn]],
      :walls => [ [ [x9-4-xb,y4-yb],[x7-xb,y4-yb],            # 入り口左からSWでっぱり
                    [x7-xb,y8-yb],[xb-xb,y8-yb],[xb-xb,yb-yb], # 膨らみからNW
		    [x8-xb,yb-yb],[x8-xb,y4-yb],[x9-xb,y4-yb]]             # 東壁から入口
                ], 
     :contents   => %w(0E),  # w 69.6m h 47.2m
      :sufix      => %w(02),
      :max        => %w(21),
      #建物基準点から置き場ブロック基準点までの m。ブロックの左上を標準にする
      :base_points => [ [6.4,1] ] ,
      :label_pos => [ [-3,15]  ]
      ),
  "0C" =>   Ubr::SoukoFloor.
  new( 
      :outline    => [[xc-xw,yc-yn],[xa-xw,y4-yc]],
      :walls => [ [ [x1r-xc,yc-yc],[xa-xc,yc-yc],[xa-xc,y2-yc],[x8-xc,y2-yc], # 北入り口右からSE凹み
		    [x8-xc,yb-yc], [xb-xc,yb-yc],[xb-xc,y2-yc],[xb-5-xc,y2-yc]], # 南入り口まで
		  [ [xb-9-xc,y2-yc],[xw-xc,y2-yc],[xw-xc,yc-yc],[x1l-xc,yc-yc]]   # 南入り口左からN入り口左まで
                ],
      :contents   => %w(0C 0C 0C 0C 0D 0D 0D 0D),
      :sufix      => %w(01 11 21 34 01 11 30 41),
      :max        => %w(10 20 33 46 10 29 40 46),
      #建物基準点から置き場ブロック基準点までの m。ブロックの左上を標準にする
      :base_points => [ [47,6],[47,11.2],[22.6,6],[22.6,11.2],  
                        [47,25.2],[47,31.4],[4.6,38],[23,25.2] ] ,
      :label_pos => [ [-10,2.5],[-10,-0.5],[-10,2.5],[-10,-0.5],  [-10,2.5],[-10,-0.5],[1,-12.5],[-5,2.5]]
      ),
  "1" => 
  Ubr::SoukoFloor.
    new(
        :name => "1",                         # 倉庫名
        :outline   => [[0,0],[90,46.5]],      # 外枠、細い線。長方形
        #                                               1B5A は作業スペース
        :contents => %w(1A1 1A2 1A3 1A4 1B2 1B3 1B4 1B5 1B5 1B5 1B6 1b),  # 枠群の名前3桁。重複可能
        :sufix    => %w(A   A    A   A  A    A   A  Z   B    N    A 1   ),  # 枠の名前下1桁
        :max      => %w(Z   Z    Z   Z  Z    Z   Z  Z   M    R    Z 6   ),  # 枠の名前下1桁の最終名
        :base_points => [[0,0], [4.7,33.9],[7.6,28.3],           # 1A  枠群原点の倉庫原点からの位置。単位m
                         [36.2,28.3],[61.2,39.9],[61.2,32.0],    # 1B2,3,4
                         [56.3,23.5],[56.3,16.0],[56.3,16.0],[86,18],[56.3,5.0],
                         [56.0,5.0]],
        :label_pos => [nil,[20,-0.2],[20,2.4],[8,2.4],             # 枠群の名前記述位置の枠群原点からの相対位置。
                       [15,-0.2],[15,4],[15,-1.4], [14,1.2], [14,1.2],[-3,-2],[14,-0.2]],
        :walls     =>[[[55,0],[90,0],[90,46.5],[63,46.5]],[[37,46.5],[0,46.5],[0,0]]   ], #converator
        :pillars => [ Ubr::Pillar.new(:kazu => [5,1],:start => [40,6.5] ,:kankaku => [10,8] , 
                                      :size => [0.4,0.5]#[1.0,0.8]
                                      ),
                      Ubr::Pillar.new(:kazu => [8,2],:start => [10,19.5] ,:kankaku => [10,14] ,
                                      :size => [0.4,0.5],:missing => [[3,2],[4,2]]
                                      )
                    ]
        ),

    "2" =>Ubr::SoukoFloor.
    new( 
        :outline   => [[0,0],[90,30]],         
      :contents  => %w(2C2 2C3 2D1 2D2 2c 2d1 2d2),
      :sufix     => %w(A   A   B   B    1  1  1),
      :max       => %w(Z   Z   Z   Z    6  6  7),
      :base_points => [[1.2,10.2], [47.2,12.6],[56.0,18.5],[56.0,12.6],[49.7,1],[55.8,18.5],[55.8,1.4]],
      :label_pos => [[6,1.5],[-10,1.5],[14,-0.2],[14,1.5]],
      :walls     => [[[0,30],[0,0],[50,0]],[[55,0],[90,0],[90,15]],[[90,19],[90,30]], 
                     Converator],
      :pillars => [ Ubr::Pillar.new(:kazu => [8,3],:start => [10,7] ,:kankaku => [10,8] ,
                               :size => [0.9,0.8],:missing => [[1,0],[1,1]]
                               )
                  ]
      ),

  "2-2" => Ubr::SoukoFloor.
    new( 
      :outline   => [[0,0],[90,30]],         
      :contents  => %w(2E1 2E2 2E3 2E4 2E5 2E1 2E5),
      :sufix     => %w(A    A   A   A   A   1  1),
      :max       => %w(Z    Z   Z   Z   Z   9  9),
      :base_points => [[1.4+1.6*44,0.4+10*1.2], [54.0,12.4],[53.8-1.6*17,12.4],
                       [4.2,17],[36.4,17],[84,1],[84,15]],
      :label_pos => [[-6,1.5],[-12,1.5],[-12,1.5],[14,-0.3],[16,-0.2],[-2,5],[-2,5]],
      :walls     => [[[0,30],[0,0],[90,0],[90,30],[0,30]] ,
                     Converator]
      ),

  "3" => Ubr::SoukoFloor.
      new(   
      :outline   => [[0,0],[39.5,32.5]],         
      :contents  => %w(3F1 3F2 3F4),
      :sufix     => %w(A   A    A),
      :max       => %w(Z   Z    Z),
      :label_pos => [ [7,0],[9,1.5],[1.5,7] ],
      :base_points => [[0.2,21.2], [10.2,15],[6.2,3]],
      :walls     => [ [[0,32.5],[0,0],[5,0]],[[10.5,0],[39.5,0],[39.5,22.5]]],
      :pillars => [ Ubr::Pillar.new(:kazu => [2,5],:start => [0,2.5] ,:kankaku => [5.0,7.5] ,
                               :size => [0.9,0.8], :missing =>[[0,1],[0,3],[1,1],[1,3]]
                               ),
                    Ubr::Pillar.new(:kazu => [2,5],:start => [10,2.5] ,:kankaku => [5.5,7.5] ,
                               :size => [0.9,0.8], :missing =>[[0,1],[0,3],[1,1],[1,3]]
                               ),
                    Ubr::Pillar.new(:kazu => [3,5],:start => [22,2.5] ,:kankaku => [6.0,7.5] ,
                               :size => [0.9,0.8], :missing =>[[0,1],[0,3],[3,1],[3,3],[1,1],[1,3]]
                               )
                  ]

      ),

  "4" => Ubr::SoukoFloor.
  new(  
      :outline   => [[0,0],[41,44]],         
      :contents  => %w(4G 4G1 4G2 4H1 4H2),
      :sufix     => %w(01  A  A    A  A),
      :max       => %w(20  Z  Z    Z  Z),
      :label_pos => [[6,8],[3,-0.1],[2,7.5],[15,8.5],[18,-0.4]],
      :base_points => [[0.4,22.4], [16,31.5],[16.8,22.4],
                       [8.8,0.4],[0.4,14.4]],
      :walls     => [ [[0,12],[0,0],[41,0],[41,12]],#4Hの蓋
                      [[0,16],[0,28]], [[41,16],[41,28]],[[0,22],[41,22]],  #4HGの境
                      [[0,32],[0,44],[41,44],[41,32]]   # 4Gの底
                    ], 
      :pillars => []
      ),
  "5-1" => Ubr::SoukoFloor.
  new( 
      :contents => %w(5I1 5I2 5J1 5J2 5K1 5K2),
      :sufix    => %w( A   A   A   A   A   A),
      :max       => %w(Z   Z   Z   Z   Z   Z),
      :label_pos => [[-15,-0.2],[-15,1.5]]*3,
      :base_points => [[93.4,18], [93.4,12],[61.0,18],
                       [61.0,12],[29.5,18],[29.5,12]],
      :outline   => [[-0.35,-0.35],[94.85,30.35]],  # 柱中心を原点とする     
      :walls     => [ [[-0.35,12.4] ,[-0.35,-0.35],[94.85,-0.35],[94.85,12.4]],#5-1Fの蓋
                      [[30.35,-0.35],[30.35,12.4]],[[62.35,-0.35],[62.35,12.4]],# 境
                      [[30.35,30.35],[30.35,17.6]],[[62.35,30.35],[62.35,17.6]],
                      [[-0.35,17.6] ,[-0.35,30.35],[94.85,30.35],[94.85,17.6]]  # 底l
                    ], 
      :pillars => [ 
                   Ubr::Pillar.new(:kazu => [6,6],:start => [0,0] ,:kankaku => [6,6] ,
                              :size => [0.7,0.7]
                              ), # 5-1F の左
                   Ubr::Pillar.new(:kazu => [10,6],:start => [36,0] ,:kankaku => [6.5,6] ,
                              :size => [0.7,0.7]
                              ) # 5-1F の右
                  ]
      ),
  "5-2" => Ubr::SoukoFloor.
  new(
      #:contents => %w(5L1 5L2  5M1  5M2  5N1  5N1 5N1  5N2 5N2 5N2 5N2 5N2),
      #:sufix    => %W(01    01    01    01    01   10  19   01  09  18  27  A),
      #:max      => %w(18    18    16    16    09   18  25   08  17  26  29   C),
      :contents => %w(5L1 5L2  5M1  5M2  5N1  5N2),
      :sufix    => %w(A    A    A   A    A    A ),
      :max      => %w(R    R    R   R    I    O ),
      :base_points => [[94,18], [94,12],  [61.5,18], [61.5,12],  # LM
                       [29.5,18],[29.5,12]],
                      # [18.5,18.7],[25.7,18.7] ,[13.7,17.5],   #
                      # [6.5,12.4],[18.5,11.2],[25.7,11.2],[24.5,12.4] ],
      :label_pos => [[-15,-0.2],[-15,1.5]]*2+[[0,-1.5],nil,nil,[12,1.5]],
      :outline   => [[-0.35,-0.35],[94.85,30.35]],  # 柱中心を原点とする     
      :walls     => [ [[-0.35,18.4] ,[-0.35,-0.35],[94.85,-0.35],[94.85,12.4]],#5-1Fの蓋
                      [[30.35,-0.35],[30.35,12.4]],[[62.35,-0.35],[62.35,12.4]],# 境
                      [[30.35,30.35],[30.35,17.6]],[[62.35,30.35],[62.35,17.6]],
                      [[-0.35,23.6] ,[-0.35,30.35],[94.85,30.35],[94.85,12.4]]  # 底
                    ], 
      :pillars => [ 
                   Ubr::Pillar.new(:kazu => [4,2],:start => [6,12] ,:kankaku => [6,6] ,
                              :size => [0.7,0.7]
                              ) # 5-2F 
                  ]
      ),
  "6" =>  Ubr::SoukoFloor.
  new(
      :outline   => [[0,0],[33,20]],         
      :contents => %w(6O1 6O2 6O3),
      :sufix    => %w(A   A   A),
      :max       => %w(Z Z Z),
      :label_pos => [[5,11.5],[-8,-0.3],[-5,3.1] ],
      :base_points => [ [11,0.4],[32.4,14.0],[8.8,1.6*3+0.4]],
      :walls     => [ [[0,7.75] ,[0,0],[33,0],[33,6]],#6の蓋
                      [[0,12.25],[0,20],[33,20],[33,14]]   # 6の底
                    ], 
      :pillars => [
                   Ubr::Pillar.new(:kazu => [7,1],:start => [0,10] ,:kankaku => [5.5,6] ,
                              :size => [0.35,0.45]
                              )]
      )

}

SP =[
     { :name => "123倉庫",
       :offset     =>[20,5] ,                              # 用紙左上から建物基準点までの mm
       :floor_offset => { "1" => [0,62.5], "2" => [0,32.5],"3" => [45,0], "2-2" => [0,113] },
       :stat_names   => %w(1A 1B 2 3 2-2F),
       :stat_reg     => [/^1A/,/^1B/,/^2[CD]/,/^3/,/^2E/],
       :stat_offset  => [5,10],:stat_font=> [1,0,0]
     },
     { :name   => "456倉庫",
       :offset =>[10,10] , 
       :floor_offset => { "4" => [53.8,90],"5-1" => [0,55],"5-2" => [0,20],"6" => [0,90]},
       :stat_names   => %w(4 5 6 5-2F),
       :stat_reg     => [/^4/,/^5[JIK]/,/^6/,/^5[LMN]/],
       :stat_offset  => [10,7],:stat_font=> [1,0,0]
     },
     { :name => "総合倉庫",:landscape => true,
       :offset     =>[25,25] ,                              # 用紙左上から建物基準点までの mm
       :floor_offset => { "0A" => [xa,ya], "0B" => [xb,yb], "0C" => [xc,yc]},
       :stat_names   => %w(0A 0B 0C 0D 0E),
       :stat_reg     => [/^0A/,/^0B/,/^0C/,/^0D/,/^0E/],
       :stat_offset  => [60,60],:stat_font=> [1,1,0]
     }
    ]
Suuro2Retu = %w(2C2Z 2D1Z 1B4Z 1B2Z 1A2Z)

end
