# -*- coding: utf-8 -*-
class UbeSkdTest < ActiveSupport::TestCase

Excel_data[:dryo]=
"																																																										
			運　転　日　報　（原乾燥）																							2012		年	4	月	26	日		（	木		）																					
	勤
・
班	運　転　状　況						生　産　枚　数												脱　板　枚　数												課長		係長		主任																						
		運転
時間(分)	休転
時間(分)	切替
時間(分)	調整
整備(分)	養生
待ち(分)	その他
(分)	Lot.
No	品種		規格	裁断
開始時刻	裁断
終了時刻	裁断時間
（分）	枚数	換算枚数	時産
（枚/H）	時産
（マイルS)
（枚/H）	速度ロス
（分）	Lot.
No		投入開始
時刻		品種			規格			枚数																規格	品種	分類	運転	換算	コード							
	1	340			25		10	2W0244M1	ﾌﾗｯﾄ		12×3×10	7:00	9:00	85	277	554	391	425	▲ 7	2W0245M1○				ﾌﾗｯﾄ			12×3×10			706		灯油使用量														12×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	85	554	１‐１２Ｆ‐１１２１Ｅ							
	勤		65		20		20	2W0245M1	ﾌﾗｯﾄ		12×3×10	9:00	15:00	255	842	1,684	396	425	▲ 17	2W0246M1○		12:43		ﾌﾗｯﾄ			12×3×10			288		Ｊ乾		メーター												12×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	255	1,684	１‐１２Ｆ‐１１２１Ｅ							
														0		0	0		0															使用量	0		ℓ									0	0	0	0	0								
														0		0	0		0													Ｍ乾		メーター	876,900											0	0	0	0	0								
	Ｂ													0		0	0		0															使用量	2,090		ℓ									0	0	0	0	0								
	班													0		0	0		0																											0	0	0	0	0								
	2	436					10	2W0245M1	ﾌﾗｯﾄ		12×3×10	15:00	16:25	75	235	470	376	425	▲ 9	2W0246M1○		15:00		ﾌﾗｯﾄ			12×3×10			1,152		灯油使用量														12×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	75	470	１‐１２Ｆ‐１１２１Ｅ							
	勤			3			10	2W0245M2	ﾌﾗｯﾄ		12×3×10	16:25	18:00	82	285	570	417	425	▲ 2	2W0247M1○		21:00		ﾌﾗｯﾄ			12×3×10			384		Ｊ乾		メーター												12×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	82	570	１‐１２Ｆ‐１１２１Ｅ							
				3			18	2W0246M1	ﾌﾗｯﾄ		12×3×10	18:00	23:00	279	845	1,690	363	425	▲ 40															使用量	0		ℓ									12×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	279	1,690	１‐１２Ｆ‐１１２１Ｅ							
														0		0	0		0													Ｍ乾		メーター	879,490											0	0	0	0	0								
	Ａ													0		0	0		0															使用量	2,590		ℓ									0	0	0	0	0								
	班													0		0	0		0																											0	0	0	0	0								
	3	415						2W0246M1	ﾌﾗｯﾄ		12×3×10	23:00	0:30	90	306	612	408	425	▲ 4	2W0247M1○				ﾌﾗｯﾄ			12×3×10			768		灯油使用量														12×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	90	612	１‐１２Ｆ‐１１２１Ｅ							
	勤			40	10		15	2W0247M1	ﾌﾗｯﾄ		12×3×10	0:30	7:00	325	974	1,948	360	425	▲ 50	2W0248M1○		4:20		ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ			12×1.5×10			480		Ｊ乾		メーター												12×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	325	1,948	１‐１２Ｆ‐１１２１Ｅ							
														0		0	0		0															使用量	0		ℓ									0	0	0	0	0								
														0		0	0		0													Ｍ乾		メーター	882,000											0	0	0	0	0								
	Ｃ													0		0	0		0															使用量	2,510		ℓ									0	0	0	0	0								
	班													0		0	0		0													Ｊ乾	0		Ｍ乾	7,190										0	0	0	0	0								
								2W0244M1	ﾌﾗｯﾄ		12×3×10			85	277	554	391	　試 ＝		　割 ＝		分類		当日換算枚数		当日時産		累計換算枚数		累計時間（分）		累計時産		目標時産		速度ロス（分）																						
		1,191	65	46	55	0	83	2W0245M1	ﾌﾗｯﾄ		12×3×10			330	1,077	2,154	392	　試 ＝		　割 ＝		12ﾌﾗｯﾄ		7,528		379		11,566		1,896		366		400		▲ 161																						
	合							2W0245M2	ﾌﾗｯﾄ		12×3×10			82	285	570	417	　試 ＝		　割 ＝		16ﾌﾗｯﾄ		0		0		5,122		832		369		310		159																						
								2W0246M1	ﾌﾗｯﾄ		12×3×10			369	1,151	2,302	374	　試 ＝		　割 ＝		12模様品		0		0		14,558		2,077		421		400		107																						
								2W0247M1	ﾌﾗｯﾄ		12×3×10			325	974	1,948	360	　試 ＝		　割 ＝		12高級		0		0		41,472		5,989		415		400		232																						
									0		0			0	0	0	0	　試 ＝		　割 ＝		15高級		0		0		135		23		352		330		2																						
									0		0			0	0	0	0	　試 ＝		　割 ＝		16高級		0		0		0		0		0		330		0																						
	計								0		0			0	0	0	0	　試 ＝		　割 ＝		S1		0		0		7,537		1,345		336		300		162																						
									0		0			0	0	0	0	　試 ＝		　割 ＝		計		7,528				80,390		12,162						501																						
	１

勤	※７：３５～８：００（２５分）縦切クランプ近接スイッチ調整
※９：０５～９：２０（１５分）縦切クラッシャートラブル、１３－３集塵フードブラケット破損の為、取り外し。
※９：４５　　含水低めの為、ウイケットスピード１７０分⇒１６０分へ。
※１０：２５　含水低めの為、ウイケットスピード１６０分⇒１５０分へ。
※１０：５０～１１：１０（２０分）縦切クランプ近接スイッチ調整、取付ビス交換
※１０：２５　含水低めの為、ウイケットスピード１５０分⇒１３０分へ。
※１１：３０～１１：５０（２０分）M乾出口製品割れ品除去										班長		脱板
吸着盤
ｽﾎﾟﾝｼﾞ	点検時刻	点検者	結果		乾燥条件																																							
												山本隆			8:05	山本隆	良			１勤						２勤						３勤																										
															10:10	山本隆	良		 J乾 温度	1	2	3	4	5	6	1	2	3	4	5	6	1	2	3	4	5	6																					
															12:25	前田	良																																									
												No.2排水口			14:05	山本隆	良																																									
												8:05	OK	JET出口	8:15	山本隆	良		 M乾 温度	1	2	3	4			1	2	3	4			1	2	3	4																							
												前田		M乾出口	8:30	三藤	良			160	175	180	180			160	175	180	180			160	175	180	180																							
														爆裂
確認	１）	良	３）	良																																								
		＊２枚防止作動確認：２nd前（			良	 ）；３rd前（	良	 ）　＊裏面確認	8:15	良	12:45	良			２）	良	４）	良	         時間	170	150	130	150					140	～１６０						160																							
	２

勤	１６：２５～１６：２８（３）　ロット切替
１８：００～１８：０３（３）　ロット切替
＊２W０２４５M１　ちょこ停　　１０分　　２W０２４５M２　ちょこ停　　１０分
　２W０２４６M１　ちょこ停　　　１８分
＊含水が高めなので、徐々にスピードおとしていく。										班長		脱板
吸着盤
ｽﾎﾟﾝｼﾞ	点検時刻	点検者	結果		 粉砕ｶｳﾝﾀｰ						枚						枚						枚																					
												福田			16:00	宮﨑	良		 再生粒 点検時刻																																							
															18:10	宮﨑	良			１勤						２勤						３勤																										
															20:00	縄田	良			8:15		No.1				19:00		No.1		良		1:00		No.1		良																						
												No.2排水口			22:10	宮﨑	良					No.2		良				No.2						No.2																								
												19:00	OK	JET出口	16:10	福田	良			12:30		No.1				20:00		No.1		良		5:00		No.1		良																						
												福田		M乾出口	16:15	福田	良					No.2		良				No.2						No.2																								
														爆裂
確認	１）	良	３）	良	　『発注依頼』（品名・規格・数量・発注者記入）																																							
		＊２枚防止作動確認：２nd前（			良	 ）；３rd前（	良	 ）　＊裏面確認	18:00	良	19:00	良			２）	良	４）	良																																								
	３

勤	　・０：３０～１：１０　　　　（４０）　　　ロット切替及び2ndゴムロールセンター出し
　・３：４０～４：５０　　　　（１０）　　　L側出側ストッパーシリンダー注油


　※２W０２４７M１　　　　チョコ停　　５回　　　１５分　　　										班長		脱板
吸着盤
ｽﾎﾟﾝｼﾞ	点検時刻	点検者	結果																																									
												中本			0:10	藤原	良															 上水メーター																										
															2:00	藤原	良		　【安全引継ぎ事項】																																							
															4:00	藤原	良		 １→２	原乾燥　７０１　足元注意！																																						
												No.2排水口			6:00	藤原	良																																									
												0:10	OK	JET出口	0:15	藤原	良		 ２→３	原乾燥　３０４　人払い確認よし！																																						
												藤永		M乾出口	0:30	藤永	良																																									
														爆裂
確認	１）	良	３）	良	 ３→１	原乾燥　４１４　合図確認！																																						
		＊２枚防止作動確認：２nd前（			良	 ）；３rd前（	良	 ）　＊裏面確認	0:30	良	4:00	良			２）	良	４）	良																																								

"
#require 'excel_shozoe'
#require 'excel_shozow'
#require 'excel_dryn'
#require 'excel_dryn'
#require 'excel_kakou'
end
