# -*- coding: utf-8 -*-
class UbeSkdTest < ActiveSupport::TestCase

Excel_data[:shozoe]="																												
																										課長	係長	
	運転日報　（東抄造）																					2012年4月26日		（木）				
																												
		ロットNo.		品種		規格	開始
時刻	終了
時刻	運転
時間	休転
時間	切替
時間	整備
時間	生産枚数		時産	達成率	別積・試作									目標		
									(分) 	(分) 	(分) 	(分) 	3尺	換算	（枚/H）	（％）										（枚/H）		
	1	2M0221		15_2・1ｺﾝﾋﾞﾗｲﾝ		15×455×3030	7:00	15:00	120 		360		180	338	169	53 					枚				枚	12普及品	550	
	勤								0 					0	0	0 					枚				枚	12目地品	465	
									0 					0	0	0 					枚				枚	15mm品	320	
	班								0 					0	0	0 					枚				枚	16高級	320	
	2	2M0221		15_2・1ｺﾝﾋﾞﾗｲﾝ		15×455×3030	15:00	17:56	176 				360	677	231	72 					枚				枚	野地板	310	
	勤	2M0222		15_2・1ｺﾝﾋﾞﾗｲﾝ		15×455×3030	17:56	23:00	259 		45		530	996	231	72 					枚				枚	ｼｮｯﾌﾟ	500	
	Ａ								0 					0	0	0 					枚				枚	S1	360	
	班								0 					0	0	0 					枚				枚			
	3	2M0222		15_2・1ｺﾝﾋﾞﾗｲﾝ		15×455×3030	23:00	1:20	125 		15		360	677	325	102 					枚				枚			
	勤	2M0223		15レンガⅡ		15×455×2952	1:20	7:00	310 		30		660	1,214	235	73 	別積	定盤ズレ有り		120	枚				枚			
	Ｃ								0 					0	0	0 					枚				枚			
	班								0 					0	0	0 	養生No.	養生開始時刻								WF	PF	
		2M0221		15_2・1ｺﾝﾋﾞﾗｲﾝ		15×455×3030	455	15_2・1ｺﾝﾋﾞﾗｲﾝ15×455×3030	296 	0	360	0	540	1,015	206	64 	No.12			15_2・1ｺﾝﾋﾞﾗｲﾝ15×455×3030	72-3-15CL-1151N		2,860	11:20	1,430	32,940	32,940	
		2M0222		15_2・1ｺﾝﾋﾞﾗｲﾝ		15×455×3030	455	15_2・1ｺﾝﾋﾞﾗｲﾝ15×455×3030	384 	0	60	0	890	1,673	261	82 	No.20			0			0	0:00	0	枚	枚	
	小	2M0223		15レンガⅡ		15×455×2952	455	15レンガⅡ15×455×2952	310 	0	30	0	660	1,214	235	73 	No.21			15レンガⅡ15×455×2952	72-3-15R-1151N		1320	5:10	660	162:13	162:13	
	計			0		0		00	0 	0	0	0	0	0	0	0 				00	#N/A		0	0:00	0	時間	時間	
				0		0		00	0 	0	0	0	0	0	0	0 				0			0	0:00	0	サラン	濃縮機	
				0		0		00	0 	0	0	0	0	0	0	0 				0			0	0:00	0	162:13		
		計							990 	0	450	0	2,090	3,902	236											時間	時間	
		運転状況／整備内容／トラブル／故障状況																										
							※７：００～１３：００運転準備											主ﾊﾞｷｭｰﾑ（1層）（cmHg）						班長		メーター項目		
							NUKP配管詰まり掃除											主ﾊﾞｷｭｰﾑ（他層）（cmHg）								切り出し		
							トラバーサ駆動チェーン張り調整											ｳｴｯﾄVS回転数（rpm）								吸着ｺﾝﾍﾞｱ		
																		ﾊﾞｯﾄ排水温度（℃）								積み込み		
	1						運転中に											ﾌｪﾙﾄ上水分（％）								厚み不良		
	勤																	ﾒ・ﾛｰﾙ後水分（％）						メクレ率			0.0%	
																		ﾌﾟﾚｽ水分（％）						吸着横流し率			0.0%	
																								厚み不良率			0.0%	
																								総合横流し率			0.0%	
																												
		安全面申送り																										
																		主ﾊﾞｷｭｰﾑ（1層）（cmHg）				7.0 		班長		メーター項目		
							*19：15～20：00　　全層目あらし試作途中、目あらしトラブル											主ﾊﾞｷｭｰﾑ（他層）（cmHg）				7.0 		宍戸		切り出し	692	
							　											ｳｴｯﾄVS回転数（rpm）				730.0 				吸着ｺﾝﾍﾞｱ	572	
							※2M0221-4～9-12　　1～4層目あらし											ﾊﾞｯﾄ排水温度（℃）				35.0 				積み込み	495	
	2						※2M0222-1～2-20　　1～4層目あらし											ﾌｪﾙﾄ上水分（％）								厚み不良	29	
	勤						※2Ｍ0222-3-20　　全層目あらし及びシートプレス3枚											ﾒ・ﾛｰﾙ後水分（％）				33.0 		メクレ率			17.3%	
																		ﾌﾟﾚｽ水分（％）						吸着横流し率			8.4%	
																								厚み不良率			5.1%	
																								総合横流し率			28.5%	
																												
		安全面申送り			合図は正確に！																							
																		主ﾊﾞｷｭｰﾑ（1層）（cmHg）				18.0 		班長		メーター項目		
							※定盤切替（レンガII）へ目あらし使用　１：０５～１：２０（１５分）											主ﾊﾞｷｭｰﾑ（他層）（cmHg）				18.0 		河崎		切り出し	678	
																		ｳｴｯﾄVS回転数（rpm）				750.0 				吸着ｺﾝﾍﾞｱ	526	
							※プレス前製品止まらない為、進入停止光電管取替　１：５０～２：１０（２０分）											ﾊﾞｯﾄ排水温度（℃）				36.0 				積み込み	464	
	3																	ﾌｪﾙﾄ上水分（％）								厚み不良	13	
	勤						※定盤ズレの為、定盤位置修正　６：３０～６：４０（１０分）											ﾒ・ﾛｰﾙ後水分（％）				38.5 		メクレ率			22.4%	
																		ﾌﾟﾚｽ水分（％）						吸着横流し率			9.3%	
																								厚み不良率			2.5%	
																								総合横流し率			31.6%	
																メーター		使用量		原単位				メーター		使用量	原単位	
		安全面申送り			手元注意ヨシ！									プレス油（前）				0		0.000 		プレス油（後）				0	0.000 	
																												
																												
																												

"
#require 'excel_shozoe'
#require 'excel_shozow'
#require 'excel_dryn'
#require 'excel_dryn'
#require 'excel_kakou'
end
