# -*- coding: utf-8 -*-
class UbeSkdTest < ActiveSupport::TestCase

Excel_data[:shozow]="																												
																										課長	係長	
	運転日報　（西抄造）																					2012年4月25日		（水）				
																												
		ロットNo.		品種		規格	開始
時刻	終了
時刻	運転
時間	休転
時間	切替
時間	整備
時間	生産枚数		時産	達成率	別積・試作									目標		
									(分) 	(分) 	(分) 	(分) 	3尺	換算	（枚/H）	（％）										（枚/H）		
	1	2w0254		ｽﾀｯｺ		12×455×3030	7:00	13:30	390 				1,440	2,880	443	84 					枚				枚	12ﾌﾗｯﾄ	530	
	勤	2w0255		ｽﾀｯｺ		12×455×3030	13:30	15:00	75 		15		288	576	461	87 					枚				枚	12普及	530	
	Ｂ								0 					0	0	0 					枚				枚	16ﾌﾗｯﾄ	420	
	班								0 					0	0	0 					枚				枚	16普及	420	
	2	2w0255		ｽﾀｯｺ		12×455×3030	15:00	19:05	235 		10		1,104	2,208	564	106 					枚				枚	野地板	310	
	勤	2w0256		ｽﾀｯｺ		12×455×3030	19:05	22:04	169 		10		810	1,620	575	108 	試作	配合試作		630	枚				枚	15普及	420	
	Ａ	2w0257		ｽﾀｯｺ		12×455×3030	22:04	23:00	56 				270	540	579	109 	試作	配合試作		270	枚				枚			
	班								0 					0	0	0 					枚				枚			
	3	2w0257		ｽﾀｯｺ		12×455×3030	23:00	2:38	198 	10	10		822	1,644	498	94 	試作	配合試作		822	枚				枚			
	勤	2w0258		ｽﾀｯｺ		12×455×3030	2:38	7:00	262 				1,056	2,112	484	91 	試作	配合試作		1056	枚				枚			
	Ｄ								0 					0	0	0 					枚				枚			
	班								0 					0	0	0 	養生No.	養生開始時刻								WF	PF	
		2w0254		ｽﾀｯｺ		12×455×3030	455	ｽﾀｯｺ12×455×3030	390 	0	0	0	1,440	2,880	443	84 	No.22			ｽﾀｯｺ12×455×3030	77-3-12S-1121E		11,580	23:05	5,790	45,836	384,917	
		2w0255		ｽﾀｯｺ		12×455×3030	455	ｽﾀｯｺ12×455×3030	310 	0	25	0	1,392	2,784	539	102 	No.23	2012/4/25 19:15		0			0	0:00	0	枚	枚	
	小	2w0256		ｽﾀｯｺ		12×455×3030	455	ｽﾀｯｺ12×455×3030	169 	0	10	0	810	1,620	575	108 	No.11	2012/4/25 22:10		0			0	0:00	0	103:25	1023:50	
	計	2w0257		ｽﾀｯｺ		12×455×3030	455	ｽﾀｯｺ12×455×3030	254 	10	10	0	1,092	2,184	516	97 	No.17			0			0	0:00	0	時間	時間	
		2w0258		ｽﾀｯｺ		12×455×3030	455	ｽﾀｯｺ12×455×3030	262 	0	0	0	1,056	2,112	484	91 	No.15			0			0	0:00	0	サラン		
				0		0		00	0 	0	0	0	0	0	0	0 				00	#N/A		0	0:00	0	103:25		
		計							1,385 	10	45	0	5,790	11,580	502											時間		
		運転状況／整備内容／トラブル／故障状況																										
																			主ﾊﾞｷｭｰﾑ（1層）（cmHg）				20.0 	班長		メーター項目		
							※１２：３０～１２４５　ライナー修正												主ﾊﾞｷｭｰﾑ（他層）（cmHg）				20.0 	芦田		前取り	1,054	
																			補助ﾊﾞｷｭｰﾑ（cmHg）				全閉			No.8	956	
							★吸着盤のスピードUPしてます。（約１.8秒）												ｳｴｯﾄVS回転数（rpm）				1150±50			吸着	897	
	1						★製品吸着盤と型板吸着盤のがっちんこトラブル３回位あり→型板裏掃除セレクト切後良し												ﾊﾞｯﾄ排水温度（℃）							厚み不良	54	
	勤																		ﾌｪﾙﾄ上水分（％）					メクレ率			9.3%	
							★型板赤から白に切替												ﾒ・ﾛｰﾙ後水分（％）				38.2 	吸着横流し率			0.5%	
																			ﾌﾟﾚｽ水分（％）				30.2 	厚み不良率			5.6%	
																								総合横流し率			14.9%	
																												
		安全面申送り																										
																			主ﾊﾞｷｭｰﾑ（1層）（cmHg）				20.0 	班長		メーター項目		
							※ロット洗浄　　１８：５５～１９：０５（１０分）												主ﾊﾞｷｭｰﾑ（他層）（cmHg）				20.0 	宍戸		前取り	2,200	1,146
							　　　　　　　　　　２１：５４～２２：０４（１０分）												補助ﾊﾞｷｭｰﾑ（cmHg）				全閉			No.8	2,035	
																			ｳｴｯﾄVS回転数（rpm）				1100±50			吸着	1,958	1,061
	2						※２ｗ０２５６　№３～　　　配合試作												ﾊﾞｯﾄ排水温度（℃）				36.0 			厚み不良	66	
	勤																		ﾌｪﾙﾄ上水分（％）					メクレ率			5.8%	
																			ﾒ・ﾛｰﾙ後水分（％）				38.0 	吸着横流し率			0.6%	
																			ﾌﾟﾚｽ水分（％）				32.0 	厚み不良率			1.1%	
																								総合横流し率			7.4%	
																												
		安全面申送り			トラブル時は落ち着いて作業																							
																			主ﾊﾞｷｭｰﾑ（1層）（cmHg）				21.0 	班長		メーター項目		
							※1：20～1：30　　叩解パルプ払出し不良による原料切れ												主ﾊﾞｷｭｰﾑ（他層）（cmHg）				21.0 	山本紀		前取り	3,300	1,100
							※2：28～2：38　　ロット洗浄												補助ﾊﾞｷｭｰﾑ（cmHg）				全閉			No.8	3,019	
																			ｳｴｯﾄVS回転数（rpm）				1100±50			吸着	2,910	952
	3						*2ｗ0257　№4～配合試作												ﾊﾞｯﾄ排水温度（℃）				36.0 			厚み不良	98	
	勤																		ﾌｪﾙﾄ上水分（％）					メクレ率			10.5%	
							*型板10㎜から9㎜に切替												ﾒ・ﾛｰﾙ後水分（％）				39.4 	吸着横流し率			0.0%	
																			ﾌﾟﾚｽ水分（％）				31.2 	厚み不良率			3.3%	
																								総合横流し率			13.5%	
																メーター		使用量		原単位				メーター		使用量	原単位	
		安全面申送り			吊り荷の下に入らない									プレス油（前）		402702.2		344.260000000009		0.114 		プレス油（後）		138121.7		143.720000000001	0.048 	
																												
																												
																												

"
#require 'excel_shozoe'
#require 'excel_shozow'
#require 'excel_dryn'
#require 'excel_dryn'
#require 'excel_kakou'
end
