# -*- coding: utf-8 -*-
class UbeSkdTest < ActiveSupport::TestCase

Excel_data[:dryn]=
"																																																					
			運　転　日　報　（新乾燥）																							2012		年	4	月	19	日		（	木	）																	
	勤
・
班	運　転　状　況						生　産　枚　数											脱　板　枚　数												課長		係長		主任														AX	AY	AZ	BA	
		裁断
時間(分)	休転
時間(分)	切替
時間(分)	調整
整備(分)	養生
待ち(分)	その他
(分)	Lot.
No	品種	規格	裁断
開始時刻	裁断
終了時刻	裁断時間
（分）	枚数	換算枚数	時産
（枚/H）	目標時産
（マイルS)
（枚/H）	速度ロス
（分）	Lot.
No	投入開始
時刻	品種				規格				枚数																				品種	分類	運転	換算	コード
	1	430	15				15	2W0231N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10	7:00	12:00	270	2,484	2,484	552	500	28	2W0231N1○		ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ				12×1.5×10				192		灯油メーター			543,850														12×1.5×10	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12ﾌﾗｯﾄ	270	2,484	１‐１２Ｆ‐１１２１Ｅ
	勤				10		10	2W0232N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10	12:00	15:00	160	1,428	1,428	536	500	11	2W0232N1○	8:01	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ				12×1.5×10				1,152		使用量			3,210														12×1.5×10	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12ﾌﾗｯﾄ	160	1,428	１‐１２Ｆ‐１１２１Ｅ
													0		0	0		0	2W0233N1○	12:30	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ				12×1.5×10				576		ｳｨｹｯﾄ電流			21		A												0	0	0	0	0	0
													0		0	0		0																														0	0	0	0	0	0
	Ｄ												0		0	0		0																														0	0	0	0	0	0
	班												0		0	0		0																														0	0	0	0	0	0
	2	399					5	2W0232N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10	15:00	16:40	95	874	874	552	500	10	2W0233N1○		ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ				12×1.5×10				576		灯油メーター			547,200														12×1.5×10	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12ﾌﾗｯﾄ	95.0000000000001	874	１‐１２Ｆ‐１１２１Ｅ
	勤		50	3			15	2W0233N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10	16:40	21:50	242	2,302	2,302	571	500	34	2W0234N1○	17:10	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ				12×1.5×10				1,152		使用量			3,350														12×1.5×10	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12ﾌﾗｯﾄ	242	2,302	１‐１２Ｆ‐１１２１Ｅ
				3			5	2W0234N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10	21:50	23:00	62.0000000000001	520	520	503	500	0													ｳｨｹｯﾄ電流			21		A												12×1.5×10	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12ﾌﾗｯﾄ	62.0000000000001	520	１‐１２Ｆ‐１１２１Ｅ
													0		0	0		0																														0	0	0	0	0	0
	Ｃ												0		0	0		0																														0	0	0	0	0	0
	班												0		0	0		0																														0	0	0	0	0	0
	3	360	20	20			15	2W0234N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10	23:00	3:10	195	1,782	1,782	548	500	19	2W0235N1○	22:45	ｶﾗｰ用14ﾌﾗｯﾄ				14×3×10				750		灯油メーター			550,110														12×1.5×10	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12ﾌﾗｯﾄ	195	1,782	１‐１２Ｆ‐１１２１Ｅ
	勤			15	25		25	2W0235N1	ﾌﾗｯﾄ	14×3×10	3:10	7:00	165	700	#N/A	#N/A	#N/A	#N/A	2W0235N2○		ｶﾗｰ用14ﾌﾗｯﾄ				14×1.5×10				420		使用量			2,910														14×3×10	ﾌﾗｯﾄ	12ﾌﾗｯﾄ	165	0	#N/A
													0		0	0		0	2W0236N1○	4:40	ｶﾗｰ用16フラット				16×1.5×10				390		ｳｨｹｯﾄ電流			21		A												0	0	0	0	0	0
													0		0	0		0																														0	0	0	0	0	0
	Ｂ												0		0	0		0																														0	0	0	0	0	0
	班												0		0	0		0													灯油使用量			9,470															0	0	0	0	0
		1,189	85	41	35	0	90	2W0231N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10			270	2,484	2,484	552	　試 ＝		　割 ＝		分類		当日換算枚数		当日時産		累計換算枚数		累計時間（分）		累計時産		目標時産		速度ロス（分）																		
								2W0232N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10			255	2,302	2,302	542	　試 ＝	3	　割 ＝		12ﾌﾗｯﾄ		9,390		474		51,448		6,209		497		470		359																		
	合							2W0233N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10			242	2,302	2,302	571	　試 ＝		　割 ＝		16ﾌﾗｯﾄ		0		0		9,718		1,272		458		370		304																		
								2W0234N1	ｶﾗｰ用ﾌﾗｯﾄ溝なしｽﾘｯﾄ	12×1.5×10			257	2,302	2,302	537	　試 ＝		　割 ＝		12模様品		0		0		9,324		1,475		379		470		▲ 285																		
								2W0235N1	ﾌﾗｯﾄ	14×3×10			165	700	1,232	448	　試 ＝		　割 ＝		野地板		0		0		10,094		2,290		264		220		463																		
									0	0			0	0	0	0	　試 ＝		　割 ＝		ｼｮｯﾌﾟ		0		0		0		0		0		-		0																		
	計								0	0			0	0	0	0	　試 ＝		　割 ＝		波ｻｲ		0		0		0		0		0		300		0																		
									0	0			0	0	0	0	　試 ＝		　割 ＝								0		0		0				▲ 0																		
									0	0			0	0	0	0	　試 ＝		　割 ＝		計		9,390				80,584		11,246						841																		
	１

勤	※７：２０～３５（０：１５）　取り出し引き抜きコンベア北側キー抜け
※８：３０　バーナー　４－２点火　スピード　220分～200分へ
※１４：３５～４５（０：１０）　粉抜き、掃除


ちょこ停止　　　＊２W０２３１　　5回　　15分
　　　　　　　　　　＊２W０２３２　　4回　　10分											班長	脱板
吸着盤
ｽﾎﾟﾝｼﾞ	点検時刻	点検者	結果		バーナー																																		
													三井		8:00	杉本伸	良		１ゾーン				２ゾーン				３ゾーン				４ゾーン				滞留時間																		
															10:00	杉本伸	良		1	2	3	4	1	2	3	4	1	2	3	4	1	2	3	4																			
															12:00	松原	良		100		130	145	155		160	165		170	180	180	180		185	185	220																		
															14:00	杉本伸	良															185			  200 (8:30)																		
														炉入口	8:10	杉本伸	良																																				
														反転	8:20	杉本伸	良																																				
														爆裂
確認	１）	良	３）	良																																			
		＊２枚防止作動確認：２nd前（			良	 ）；３rd前（	良	 ）							２）	良	４）	良																																			
	２

勤	　・１６：４０～１６：４３　　　　（３）　　　ロット切り替え
　・１８：４５～１８：５５　　　（１０）　　　冷却機中間ｃ／ｖチェーン外れ
　・２０：５０～２１：３０　　　（４０）　　　脱板搬入No３キー抜けの為エンドプレート取り付け
　・２１：５０～２１：５３　　　　（３）　　　ロット切り替え

　※チョコ停　　　２W０２３２　　2回　　　　５分
　　　　　　　　　　　２W０２３３　　5回　　　15分
　　　　　　　　　　　２W０２３４　　2回　　　　5分											班長	脱板
吸着盤
ｽﾎﾟﾝｼﾞ	点検時刻	点検者	結果		　【安全引継ぎ事項】																																		
													中本		16:00	藤永	良		 １→２		作業手順書　　　１０３
　　　　　　　　合図の徹底																																
															18:00	藤永	良																																				
															20:00	藤永	良		 ２→３		作業手順書　　　３０２
　　　　　　　　足元注意																																
															22:00	藤永	良																																				
														炉入口	16:10	藤永	良		 ３→１		作業手順書　　　３０３
　　　　　　　　手元注意																																
														反転	16:15	藤原	良																																				
														爆裂
確認	１）	良	３）	良	　『発注依頼』（品名・規格・数量・発注者記入）																																		
		＊２枚防止作動確認：２nd前（			良	 ）；３rd前（	良	 ）							２）	良	４）	良	赤チョーク　　1箱　　　三井																																		
	３

勤	※０：４０～１：００（２０分）脱板横送りNo７CVチェーン切れ、炉出口No６平ベルト切れ
※２：４０～３：００（２０分）２W０２３４～２３５バーナー調整間（LOT間）塗量希釈変更作業
※３：１０～３：２５（１５分）２W０２３４～２３５へ、ライン切り替え（寸法・角・直線調整）
※４：００～４：１５（１５分）直線調整
※５：４５～５：５５（１０分）粉抜き、掃除

ちょこ停止　　　＊２W０２３４　　６回　　１５分
　　　　　　　　　　＊２W０２３２　１０回　　２５分											班長	脱板
吸着盤
ｽﾎﾟﾝｼﾞ	点検時刻	点検者	結果																																				
													山本隆		0:05	三藤	良																																				
															2:20	三藤	良																																				
															4:15	山本隆	良																																				
															6:00	三藤	良		　【備考】																																		
														炉入口	0:10	三藤	良																																				
														反転	0:40	前田	良																																				
														爆裂
確認	１）	良	３）	良																																			
		＊２枚防止作動確認：２nd前（			良	 ）；３rd前（	良	 ）							２）	良	４）	良																																			
																																																					
		コード																																																			

"
#require 'excel_shozoe'
#require 'excel_shozow'
#require 'excel_dryn'
#require 'excel_dryn'
#require 'excel_kakou'
end
