# -*- coding: utf-8 -*-
class UbeSkdTest < ActiveSupport::TestCase

Excel_data[:kakou]="																												
																												
																												
	生 産 受 払 日 報																								記入欄新設			
					2012	年	4	月	25	日															(改定年月日：2012.2.20)			
												▼リスト選択	入力	自動表示											時間記入は分単位記入			
																												
勤　務	ﾛｯﾄNo	品　種	投入枚数	Ａ品枚数	Ｂ品枚数	不良率
(％)	不良項目	換算率	換算
投入枚数	換算
A品枚数	時産
(枚/時)	基準速度
（ﾏｲﾙS)	運転
（ﾏｲﾙS)
(分）	速度ロス
（分）	運転
速度	運転
（分）	品種切替
L-R
(分）	刃物替え
刃物調整
(分）	直線調整
目地調整
（分）	整備
予防保全
（分）	故障
（分）	始終業
作業
(分）	未計上
再投入
（分）	ネタ待ち
（分）	その他
（分）			
 1 勤	2M0216	ｶﾗｰ用ﾚﾝｶﾞ	708	622	86	12.1 	目地12.27	0.98 	694	610	555 	780 	53 	▲ 22	800	75												
Ａ 班	2M0217	ｶﾗｰ用ﾚﾝｶﾞ	1,699	1,438	261	15.4 	目地12.59	0.98 	1,665	1,409	540 	780 	128 	▲ 57	800	185	20		20									
	2M0218	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	1,111	990	121	10.9 		1.00 	1,111	990	476 	780 	85 	▲ 55	800	140	40											
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
			3,518	3,050	468				3,470	3,009			267 	▲ 133		400	60	0	20	0	0	0	0	0	0			
 2 勤	2M0218	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	876	822	54	6.2 		1.00 	876	822	526 	780 	67 	▲ 33	800	100												
Ｃ 班	2M0219	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	2,511	2,297	214	8.5 		1.00 	2,511	2,297	579 	780 	193 	▲ 67	800	260	15	10							40			
	2M0220	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	238	181	57	23.9 		1.00 	238	181	317 	780 	18 	▲ 27	800	45	10											
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
			3,625	3,300	325				3,625	3,300			279 	▲ 126		405	25	10	0	0	0	0	0	0	40			
 3 勤	2M0220	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	1,597	1,438	159	10.0 		1.00 	1,597	1,438	581 	780 	123 	▲ 42	800	165	5											
Ｂ 班	2W0238	ｽﾀｯｺﾀﾃ	2,301	2,229	72	3.1 		1.00 	2,301	2,229	746 	780 	177 	▲ 8	800	185	60											
	2W0239	ｽﾀｯｺﾀﾃ	440	411	29	6.6 		1.00 	440	411	660 	780 	34 	▲ 6	800	40	10	15										
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
					0	0.0 					0 		0 	0														
			4,338	4,078	260				4,338	4,078			334 	▲ 56		390	75	15	0	0	0	0	0	0	0			
合計	2M0216	ｶﾗｰ用ﾚﾝｶﾞ	708	622	86	12.1 	目地12.27	0.98 	694	610	555 	780 	53 	▲ 22	800	75	0	0	0	0	0	0	0	0	0		2M021	1
	2M0217	ｶﾗｰ用ﾚﾝｶﾞ	1,699	1,438	261	15.4 	目地12.59	0.98 	1,665	1,409	540 	780 	128 	▲ 57	800	185	20	0	20	0	0	0	0	0	0		2M021	0
	2M0218	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	1,987	1,812	175	8.8 		1.00 	1,987	1,812	497 	780 	153 	▲ 87	1,600	240	40	0	0	0	0	0	0	0	0		2M021	0
	2M0219	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	2,511	2,297	214	8.5 		1.00 	2,511	2,297	579 	780 	193 	▲ 67	800	260	15	10	0	0	0	0	0	0	40		2M021	0
	2M0220	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ	1,835	1,619	216	11.8 		1.00 	1,835	1,619	524 	780 	141 	▲ 69	1,600	210	15	0	0	0	0	0	0	0	0		2M022	1
	2W0238	ｽﾀｯｺﾀﾃ	2,301	2,229	72	3.1 		1.00 	2,301	2,229	746 	780 	177 	▲ 8	800	185	60	0	0	0	0	0	0	0	0		2W023	1
	2W0239	ｽﾀｯｺﾀﾃ	440	411	29	6.6 		1.00 	440	411	660 	780 	34 	▲ 6	800	40	10	15	0	0	0	0	0	0	0		2W023	0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
			0	0	0	0.0 					0 		0 	0	0	0	0	0	0	0	0	0	0	0	0			0
	2		11,481	10,428	1,053				11,433	10,387	574.034811715481	9.1%	879 	▲ 316		1,195	160	25	20	0	0	0	0	0	40			
																												
備　考	灯油メーター：	735,099																										
 1 勤    ・	ｶﾗｰ用ﾚﾝｶﾞ（M0216）～ｶﾗｰ用ﾚﾝｶﾞ（M0217）へ切替										8：15～　8：25		 3 勤    ・	Ｒ→Ｌ											24：05～24：10			
・	目地調整										8：40～　8：50		・	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ～ｶﾗｰ用ｽﾀｯｺﾀﾃへ切替											1：50～　2：50			
・	Ｌ→Ｒ										10：10～10：20		・	ｶﾗｰ用ｽﾀｯｺﾀﾃ（Ｗ0238）～ｶﾗｰ用ｽﾀｯｺﾀﾃ（Ｗ0239）へ切替											5：55～　6：05			
・	目地調整										10：25～10：35		・	3Ｒｸﾗｯｸ、予備刃なしの為2Ｒ荒取り調整											6：35～　6：50			
・	ｶﾗｰ用ﾚﾝｶﾞ～ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞへ切替										12：00～12：30		・															
・	R→L										14：10～14：20		・															
													・															
	※ｶﾗｰ用ﾚﾝｶﾞ　M0216　長い　606　枚　　短い　　16　枚												・															
	※ｶﾗｰ用ﾚﾝｶﾞ　M0217　長い　517　枚　　短い　　921　枚												・															
	※ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ　M0218　厚い　770　枚　　薄い　　220　枚												・	※ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ　M0220　厚い　1140　枚　　薄い　　298　枚														
													・															
	※ｶﾗｰ用ﾚﾝｶﾞ、ﾅﾁｭﾗﾙﾘﾌﾞ振り分けﾊﾟﾚｯﾄ入れ替えの為、時産ﾀﾞｳﾝ												・	※ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ振り分けﾊﾟﾚｯﾄ入れ替えの為、時産ﾀﾞｳﾝ														
																												
 安全引継ぎ事項　：		作業手順書323読み合わせ			ﾙｰﾙを守ろう								 安全引継ぎ事項　：		作業手順書325読み合わせ				ﾘﾌﾄの運転注意									
																												
 2 勤    ・	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ（M0218）～ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ（M0219）へ切替										16：40～16：50		品名					コード				投入	時間	Ｂ品				
・	Ｌ→Ｒ										19：25～19：30		ｶﾗｰ用ﾚﾝｶﾞ					１-１２R-１１２７E				2,407	4:20	347				
・	3Lｾｯﾄ刃取替　（ K-003 → K-001 ）										19：40～19：50																	
・	ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ（M0219）～ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ（M0220）へ切替										22：05～22：15		ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ					１-１２NR-１１２１E				6,333	11:50	605				
																												
																												
	※ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ　（M0218）　　厚い　596　枚　　薄い　　226　枚												ｽﾀｯｺﾀﾃ					１-１２S-T１２１E				2,741	3:45	101				
	※ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ　（M0219)　　厚い　1458　枚　　薄い　　839　枚																											
	※ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ　（M0220）　厚い　146　枚　　薄い　　35　枚																											
																												
																												
	※ｶﾗｰ用ﾅﾁｭﾗﾙﾘﾌﾞ振り分けﾊﾟﾚｯﾄ入れ替えの為、時産ﾀﾞｳﾝ																											
																												
 安全引継ぎ事項　：		作業手順書324読み合わせ			焦らず作業する																							
																												
 発注依頼　（品名・規格・数量・発注者記入）																												
																												
																												
																					会議							
								L-R													投入前チェック							
								品種切替		刃物替え	直線調整					整備		始業作業	ぎふセラ厚み選別		選別							
								ロット替え		刃物調整	目地調整				運転	予防保全	故障	終業作業	野地板再投入	ネタ待ち	食事							
								切替		刃物	調整				運転	整備	故障	始終業	未計上	ネタ待ち	その他							

"
#require 'excel_shozoe'
#require 'excel_shozow'
#require 'excel_dryn'
#require 'excel_dryn'
#require 'excel_kakou'
end
